nguyenngocsang1410/stm32_controller_board/Project_Collect_Motor_Data/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
 ******************************************************************************
 * @file           : main.h
 * @brief          : Header for main.c file.
 *                   This file contains the common defines of the application.
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2022 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f1xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
#include "stdbool.h"
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define OSC1_Pin GPIO_PIN_0
#define OSC1_GPIO_Port GPIOD
#define OSC2_Pin GPIO_PIN_1
#define OSC2_GPIO_Port GPIOD
#define ECD2A_Pin GPIO_PIN_0
#define ECD2A_GPIO_Port GPIOA
#define ECD2B_Pin GPIO_PIN_1
#define ECD2B_GPIO_Port GPIOA
#define AIN_Pin GPIO_PIN_2
#define AIN_GPIO_Port GPIOA
#define LED1_Pin GPIO_PIN_4
#define LED1_GPIO_Port GPIOA
#define LED2_Pin GPIO_PIN_5
#define LED2_GPIO_Port GPIOA
#define PWM_1_Pin GPIO_PIN_6
#define PWM_1_GPIO_Port GPIOA
#define PWM_2_Pin GPIO_PIN_7
#define PWM_2_GPIO_Port GPIOA
#define BTN_START_Pin GPIO_PIN_0
#define BTN_START_GPIO_Port GPIOB
#define BTN_STOP_Pin GPIO_PIN_1
#define BTN_STOP_GPIO_Port GPIOB
#define MODE_PIN_Pin GPIO_PIN_10
#define MODE_PIN_GPIO_Port GPIOB
#define LMS_m_Pin GPIO_PIN_12
#define LMS_m_GPIO_Port GPIOB
#define LMS_m_EXTI_IRQn EXTI15_10_IRQn
#define M2_L_Pin GPIO_PIN_14
#define M2_L_GPIO_Port GPIOB
#define M2_R_Pin GPIO_PIN_15
#define M2_R_GPIO_Port GPIOB
#define LVL_PIN1_Pin GPIO_PIN_3
#define LVL_PIN1_GPIO_Port GPIOB
#define LVL_PIN2_Pin GPIO_PIN_4
#define LVL_PIN2_GPIO_Port GPIOB
#define LMS1_Pin GPIO_PIN_5
#define LMS1_GPIO_Port GPIOB
#define LMS1_EXTI_IRQn EXTI9_5_IRQn
#define LMS2_Pin GPIO_PIN_6
#define LMS2_GPIO_Port GPIOB
#define LMS2_EXTI_IRQn EXTI9_5_IRQn
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
